import {KeywordContent} from "../../components/modal/KeywordContent";

const content = `
### 第１条（目的）
1. 本規約は、ピクチャレ大会の円滑な運営、ランキング等のコンテンツの公平性の維持のために、運営者およびユーザーそれぞれの権利と義務を定めます。
1. https://pik5.net/keyword/rules に掲載されているすべての文書は本規約を構成します。
1. 前項に加えて、本規約が定めるリンク先もユーザーが守るべきルールとして制定します。これには各ランキングのレギュレーションが含まれます。
1. 本規約外における取り決めと本規約の内容が矛盾する場合は、原則として本規約の取り決めを優先します。ただし管理人が特例を認める場合はこの限りではありません。

### 第２条（定義）

本規約における主な定義について以下の通り定めます。

1. 「当サイト」とは、https://pik5.net ドメイン以下すべてのページを指します。
1. 「コンテンツ」とは、当サイトに保管されるすべてのデータを指します。外部APIによって取得されたデータはこれに含みません。
1. 「管理人」とは、こっぱちゃ（@koppachappy）を指します。管理人がユーザーと同じ利用方法で当サイトを利用するかぎり、管理人はユーザーでもあります。
1. 「ユーザー」とは、当サイトを閲覧、登録、投稿、または当サイトが管轄するピクミン界隈Discordサーバー内に参加することを指します。「プレイヤー」も同義とします。
1. 「ユーザーコンテンツ」とは、ユーザーが当サイトに投稿し、当サイトや管理人がアカウントを所有する連携先のサーバーに保持されている情報データのうち、
スクリーンネーム、証拠写真（画像ファイル）、コメント、キーワードの編集内容など原則として権利がユーザーに帰属するデータが該当します。ここにはゲームのスコアは含まれません。
1. 「スコア情報」とは、ユーザーが当サイトに投稿したゲームのスコアやそれに付随する情報を指します。
スコアそのもの、ユーザーID、投稿日時、操作方法、リージョンなどのプレイ情報が該当します。これらの所有権は投稿成功時点で**原則として管理人に帰属**します。

### 第３条（参加条件）


### 第４条（免責事項）

1. 管理人は、当サイトの運営に関する操作や活動等によりユーザーに不利益や損害を与えたとしても、原則として責任を追わないものとします。
同様に、当サイトに関連したユーザーの操作や活動等により発生した不利益や損害についても同様とします。
たとえば、パスワードの使い回しや流出によるセキュリティ・インシデントはこの範疇です。
2. 前項の例外として、管理人の重大な過失により管理人が責任を負うことが妥当であると客観的に判断できる場合はこのかぎりではありません。

### 第５条（禁止事項）

当サイトではユーザーの禁止行為について本条の通り定め、ユーザーは利用規約に同意した時点ですべての禁止事項を犯さないことを約束したものとみなします。
管理人および管理人により委任された者は、これに違反した者を第６条の規定により処分できるものとします。

#### A　ユーザー登録

1. 当サイトでは、同一人物による複数アカウントの登録は認めません。
1. 当サイトでは、アカウントの譲渡、貸し借り、売買、またはユーザー情報の一部を他人の指示によって変更することは認めません。
1. 当サイトでは、ユーザースコアの存在が参加者全体のランクポイントに影響することを考慮し、原則として**アカウントの削除はできません**。ただし、管理人が認めた場合は例外としてこれを許可することがあります。
1. 当サイトは、実名での登録は本人が特に希望する場合を除いてできません。
1. 当サイトでは、登録者本人ではない他者（実在する人物や架空のキャラクターなど）を想起させるようなスクリーンネームやユーザーIDの登録やなりすまし行為は禁止します。

#### B　投稿

1. 当サイトでは、スコア情報を偽って投稿することはその内容や程度にかかわらず絶対に禁止します。ただし不可抗力による投稿ミスの場合、すみやかに管理人に報告するか削除機能で削除すれば違反状態を免れるものとします。
1. 当サイトでは、公序良俗に反する文章や名称を投稿することはできません。ただしピクミンシリーズ公式により言及されている内容に関してはこのかぎりではありません。
また、本項の適用範囲は当サイトによって管轄するDiscordサーバーのテキストチャットにも及びます。
1. その他、管理人や他ユーザーにとって迷惑となるような投稿はできません。
1. 投稿時点で公開設定にしていた証拠動画を、投稿後に非公開にする行為は認めません。

#### C　サイトの利用

1. 当サイトに対するハッキング行為などの不正アクセスや、DDoS攻撃などのサーバーに負荷を与える行為は絶対に禁止します。
1. 当サイトに対するスクレイピング行為は認めていません。
1. 当サイトにおいて更新ボタンやサイト内に設置してあるボタンを必要以上に連打することは禁止しています。
1. 当サイトの存続中に、ユーザーが当サイトとは別にピクミンシリーズを対象とした類似のサービスを展開することは認めていません。
1. ユーザー本人に権利が帰属しない情報は、転載などの二次利用を認めていません。ただし他のユーザーに権利が帰属する情報は、当該ユーザーの許可を得ているかぎり本項の対象外とします。

#### D　SNSの利用

1. SNS等（Twitterなどのマイクロブログや匿名掲示板、動画サイトなどを含むネットコミュニティ全般。以下同様）において、当サイトやピクミンシリーズに対するヘイト投稿や管理人やユーザーに対する誹謗中傷や名誉毀損などの攻撃行為は禁止します。
1. SNS等における管理人や特定ユーザーのなりすまし行為は禁止します。
1. 当サイトに紐づいたSNS等のアカウントを用いて反社会的な活動や倫理に悖る投稿を行うことは認めていません。
1. 当サイトのコンテンツのうち、一般公開されていない情報を管理人の許可を得ずにSNS等に掲載することは絶対に禁止します。
1. ピクミン界隈のみを対象として、ピクミン以外のゲームを主体としたイベントを開催することは原則として禁止します。

### 第６条（違反者に対する措置）

前条の禁止事項を犯した者は、管理人または管理人が委任した者によって以下のようなペナルティを課すことがあります。

1. アカウントの永久ロック。（これが適用された時点でユーザーコンテンツのすべての権利は没収され管理人に帰属します）。
1. 投稿機能の一時的あるいは永久的なロック。
1. 特定のIPアドレスやホストに対するアクセス禁止措置。
1. 期間限定ランキングなどのイベントへの一時的あるいは永久的な参加権剥奪。
1. SNS等のアカウントとの紐付け解除。

これは、対象やその内容が明確でなくとも、客観的にその違反が強く疑われるかぎり、管理人または管理人が委任した者の判断によって任意の対象に対して発動できるものとします。
その場合、違反者は話し合いによってこれに異議を唱えることができます。
上記の他、日本の法律を犯している場合など悪質な場合は管理人の独断で警察や弁護士に相談するなどの措置をとります。

- また、特にユーザースコアの虚偽報告に関しては別途当サイト内に定める「潔白証明ガイドライン」によって無実を証明できるものとします。
違反を疑われた者の自己都合によってこのガイドラインの施行が困難な場合、管理人は一方的に虚偽か否かの判断ができるものとします。
- 過去に重大な虚偽報告をした者やピクミン界隈コミュニティに多大な迷惑をかけた者は永久出禁とし、ユーザー登録できません。

### 第７条（サービスの存続）

1. 管理人は当サイトの提供終了および第三者への運営権譲渡に関する単独決定権を持ちます。ユーザーはこれに異議を申し立てることはできません。
1. 特に以下に定める条項によって管理人がサービスの存続が困難であると判断した場合、管理人はサービスの一時停止または永続停止を決定することがあります。

    1. 日本国内において大きな災害が発生し、運営が困難になった場合。
    1. 当サイトをホスティングするVPSサービスにおいて障害が発生し、サービスの提供が困難になった場合。
    1. セキュリティ・インシデントが発生した場合。
    1. 特定のユーザー、または第三者、または不特定多数などによってサービスの運営を妨害され、即時対処が困難な場合。
    1. 権利元、ホスティングサービス提供者、その他当サイトにかかわる権利を保有する権利者からサービスの差し止めを要求され、管理人がこれを承諾した場合。
    1. 管理人の身元上のトラブルにより運営が困難になった場合。
    1. 管理人が認知するピクミンコミュニティが衰退または変化し、当サイトを存続する意義が薄れたと判断できる場合。
    1. その他、管理人がやむを得ずサービス停止する必要があると判断した場合。

### 第８条（権利）

### 第９条（プライバシー）

1. 管理人は、本サイトの運営によって知り得たユーザーの秘匿情報を厳密に管理し、それを公開することがないように務める義務を負います。
1. 本サイトはCookieを利用しています。本サイトは利便性向上を目的としてCookieを操作することがあり、ユーザーはそれに同意する必要があります。
1. 本サイトは利便性向上のためにユーザーのIPアドレスなどアクセス情報を収集することがあります。管理人はこれを個別に公開することはできませんが、各情報を特定できない形で解析結果を公開することはできるものとします。
1. 本サイトは広告の適切な表示のために、Google社およびその提携先に対してユーザーのアクセス情報を提供することがあります。
1. 本規約において発生する管理人の秘匿義務は、第７条の定めによって第三者にサービス運営権を譲渡する場合、例外的に適用されないものとします。
1. その他、プロモーション活動やコラボレーション等のビジネス上の必要性に迫られて個人情報の取扱が必要になった場合は、管理人は事案ごとにプライバシーの公開範囲をお知らせするものとします。

### 第10条（本規約の変更）

1. 規約が変更された場合は、 https://pik5.net/keyword/rules に反映され、反映が確認されたことをもって発効します。
ユーザーは利用しているかぎり、利用時点で最新の規約に同意したものとみなします。
1. ユーザーはある時点での差分を閲覧する権利があり、その達成のために管理人は利用規約全文とその差分のすべてをGithub上に公開する義務を負います。

### 第11条（準拠法および管轄裁判所）

1. 本規約は日本国の法律を準拠法とします。
また、本規約および本サイトに関する一切の紛争については、東京地方裁判所を第一審の専属的合意管轄裁判所とします。

`

const data = {
    unique_id: "rules",
    flag: 1,
    category: "terms",
    keyword: "利用規約・ルール集",
    tag: "編集保護",
    yomi: "りようきやく・るーるしゅう",
    first_editor: "koppacha",
    last_editor: "koppacha",
    content: content
}

function Rules(){
    return (
        <>
            <KeywordContent data={data}/>
        </>
    )
}

export default Rules