import {KeywordContent} from "../../components/KeywordContent";

const content = `
### 第１条（目的）
1. 本規約は、ピクチャレ大会の円滑な運営、ランキング等のコンテンツの公平性の維持のために、運営者およびユーザーそれぞれの権利と義務を定めます。
1. https://pik5.net/keyword/rules に掲載されているすべての文書は本規約を構成します。
1. 前項に加えて、本規約が定めるリンク先もユーザーが守るべきルールとして制定します。これには各ランキングのレギュレーションが含まれます。
1. 本規約外における取り決めと本規約の内容が矛盾する場合は、原則として本規約の取り決めを優先します。ただし管理人が特例を認める場合はこの限りではありません。

### 第２条（定義）

本規約における定義について以下の通り定めます。

1. 「当サイト」とは、https://pik5.net ドメイン以下すべてのページを指します。
1. 「管理人」とは、こっぱちゃ（@koppachappy）を指します。管理人がユーザーと同じ利用方法で当サイトを利用するかぎり、管理人はユーザーでもあります。
1. 「ユーザー」とは、当サイトを閲覧、登録、投稿、または当サイトが管轄するピクミン界隈Discordサーバー内に参加することを指します。
1. 「ユーザーコンテンツ」とは、ユーザーが当サイトに投稿し、当サイトや連携先のサーバーに保持されている情報データを指します。
証拠写真（画像ファイル）、コメント、キーワードの編集内容などの文章データが該当します。ゲームのスコアは含まれません。
1. 「ユーザースコア」とは、ユーザーが当サイトに投稿したゲームのスコアやランキングの情報表示に必要な付加情報を指します。
スコアそのもの、ユーザー名、ユーザーID、投稿日時、操作方法、リージョンが該当します。

### 第３条（参加条件）

### 第４条（免責事項）

### 第５条（禁止事項）

### 第６条（違反者に対する措置）

### 第７条（サービスの存続）

### 第８条（権利）

### 第９条（プライバシー）

### 第10条（本規約の変更）

### 第11条（準拠法および管轄裁判所）

`

const data = {
    unique_id: "rules",
    flag: 1,
    category: "terms",
    keyword: "利用規約・ルール集",
    tag: "編集保護",
    yomi: "りようきやく・るーるしゅう",
    first_editor: "koppacha",
    last_editor: "koppacha",
    content: content
}

function Rules(){
    return (
        <>
            <KeywordContent data={data}/>
        </>
    )
}

export default Rules